codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mm0032gpl028.h
extern volatile __CLC2CONbits_t CLC2CONbits __asm__ ("CLC2CON") __attribute__((section("sfrs")));
extern volatile unsigned int        CLC2CONCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CLC2CONSET __attribute__((section("sfrs")));
extern volatile unsigned int        CLC2CONINV __attribute__((section("sfrs")));
extern volatile unsigned int        CLC2SEL __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned DS1:3;
    unsigned :1;
    unsigned DS2:3;
    unsigned :1;
    unsigned DS3:3;
    unsigned :1;
    unsigned DS4:3;
  };
  struct {
    unsigned w:32;
  };
} __CLC2SELbits_t;
extern volatile __CLC2SELbits_t CLC2SELbits __asm__ ("CLC2SEL") __attribute__((section("sfrs")));
extern volatile unsigned int        CLC2SELCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CLC2SELSET __attribute__((section("sfrs")));
extern volatile unsigned int        CLC2SELINV __attribute__((section("sfrs")));
extern volatile unsigned int        CLC2GLS __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned G1D1N:1;
    unsigned G1D1T:1;
    unsigned G1D2N:1;
    unsigned G1D2T:1;
    unsigned G1D3N:1;
    unsigned G1D3T:1;
    unsigned G1D4N:1;
    unsigned G1D4T:1;
    unsigned G2D1N:1;
    unsigned G2D1T:1;
    unsigned G2D2N:1;
    unsigned G2D2T:1;
    unsigned G2D3N:1;
    unsigned G2D3T:1;
    unsigned G2D4N:1;
    unsigned G2D4T:1;
    unsigned G3D1N:1;
    unsigned G3D1T:1;
    unsigned G3D2N:1;
    unsigned G3D2T:1;
    unsigned G3D3N:1;
    unsigned G3D3T:1;
    unsigned G3D4N:1;
    unsigned G3D4T:1;
    unsigned G4D1N:1;
    unsigned G4D1T:1;
    unsigned G4D2N:1;
    unsigned G4D2T:1;
    unsigned G4D3N:1;
    unsigned G4D3T:1;
    unsigned G4D4N:1;
    unsigned G4D4T:1;
  };
  struct {
    unsigned w:32;
  };
} __CLC2GLSbits_t;
extern volatile __CLC2GLSbits_t CLC2GLSbits __asm__ ("CLC2GLS") __attribute__((section("sfrs")));
extern volatile unsigned int        CLC2GLSCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CLC2GLSSET __attribute__((section("sfrs")));
extern volatile unsigned int        CLC2GLSINV __attribute__((section("sfrs")));
extern volatile unsigned int        OSCCON __attribute__((section("sfrs")));
typedef struct {
  unsigned OSWEN:1;
  unsigned SOSCEN:1;
  unsigned :1;
  unsigned CF:1;
  unsigned SLPEN:1;
  unsigned :2;
  unsigned CLKLOCK:1;
  unsigned NOSC:3;
  unsigned :1;
  unsigned COSC:3;
  unsigned :9;
  unsigned FRCDIV:3;
} __OSCCONbits_t;
extern volatile __OSCCONbits_t OSCCONbits __asm__ ("OSCCON") __attribute__((section("sfrs")));
extern volatile unsigned int        OSCCONCLR __attribute__((section("sfrs")));
extern volatile unsigned int        OSCCONSET __attribute__((section("sfrs")));
extern volatile unsigned int        OSCCONINV __attribute__((section("sfrs")));
extern volatile unsigned int        SPLLCON __attribute__((section("sfrs")));
typedef struct {
  unsigned :7;
  unsigned PLLICLK:1;
  unsigned :8;
  unsigned PLLMULT:7;
  unsigned :1;
  unsigned PLLODIV:3;
} __SPLLCONbits_t;
extern volatile __SPLLCONbits_t SPLLCONbits __asm__ ("SPLLCON") __attribute__((section("sfrs")));
extern volatile unsigned int        SPLLCONCLR __attribute__((section("sfrs")));
extern volatile unsigned int        SPLLCONSET __attribute__((section("sfrs")));
extern volatile unsigned int        SPLLCONINV __attribute__((section("sfrs")));
extern volatile unsigned int        RCON __attribute__((section("sfrs")));
typedef struct {
  unsigned POR:1;
  unsigned BOR:1;
  unsigned IDLE:1;
  unsigned SLEEP:1;
  unsigned WDTO:1;
  unsigned :1;
  unsigned SWR:1;
  unsigned EXTR:1;
  unsigned :1;
  unsigned CMR:1;
  unsigned :6;
  unsigned VBAT:1;
  unsigned VBPOR:1;
  unsigned :8;
  unsigned BCFGFAIL:1;
  unsigned BCFGERR:1;
  unsigned :2;
  unsigned PORCORE:1;
  unsigned PORIO:1;
} __RCONbits_t;
extern volatile __RCONbits_t RCONbits __asm__ ("RCON") __attribute__((section("sfrs")));
extern volatile unsigned int        RCONCLR __attribute__((section("sfrs")));
extern volatile unsigned int        RCONSET __attribute__((section("sfrs")));
extern volatile unsigned int        RCONINV __attribute__((section("sfrs")));
extern volatile unsigned int        RSWRST __attribute__((section("sfrs")));
typedef struct {
  unsigned SWRST:1;
} __RSWRSTbits_t;
extern volatile __RSWRSTbits_t RSWRSTbits __asm__ ("RSWRST") __attribute__((section("sfrs")));
extern volatile unsigned int        RSWRSTCLR __attribute__((section("sfrs")));
extern volatile unsigned int        RSWRSTSET __attribute__((section("sfrs")));
extern volatile unsigned int        RSWRSTINV __attribute__((section("sfrs")));
extern volatile unsigned int        RNMICON __attribute__((section("sfrs")));
typedef struct {
  unsigned NMICNT:16;
  unsigned WDTS:1;
  unsigned CF:1;
  unsigned LVD:1;
  unsigned GNMI:1;
  unsigned :3;
  unsigned SWNMI:1;
  unsigned WDTO:1;
} __RNMICONbits_t;
extern volatile __RNMICONbits_t RNMICONbits __asm__ ("RNMICON") __attribute__((section("sfrs")));
extern volatile unsigned int        RNMICONCLR __attribute__((section("sfrs")));
extern volatile unsigned int        RNMICONSET __attribute__((section("sfrs")));
extern volatile unsigned int        RNMICONINV __attribute__((section("sfrs")));
extern volatile unsigned int        PWRCON __attribute__((section("sfrs")));
typedef struct {
  unsigned VREGS:1;
  unsigned RETEN:1;
  unsigned SBOREN:1;
} __PWRCONbits_t;
extern volatile __PWRCONbits_t PWRCONbits __asm__ ("PWRCON") __attribute__((section("sfrs")));
extern volatile unsigned int        PWRCONCLR __attribute__((section("sfrs")));
extern volatile unsigned int        PWRCONSET __attribute__((section("sfrs")));
extern volatile unsigned int        PWRCONINV __attribute__((section("sfrs")));
extern volatile unsigned int        REFO1CON __attribute__((section("sfrs")));
typedef struct {
  unsigned ROSEL:4;
  unsigned :4;
  unsigned ACTIVE:1;
  unsigned DIVSWEN:1;
  unsigned :1;
  unsigned RSLP:1;
  unsigned OE:1;
  unsigned SIDL:1;
  unsigned :1;
  unsigned ON:1;
  unsigned RODIV:15;
} __REFO1CONbits_t;
