codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mm0032gpl028.h
#define _CNPDB_CNPDB9_POSITION                   0x00000009
#define _CNPDB_CNPDB9_MASK                       0x00000200
#define _CNPDB_CNPDB9_LENGTH                     0x00000001

#define _CNPDB_CNPDB10_POSITION                  0x0000000A
#define _CNPDB_CNPDB10_MASK                      0x00000400
#define _CNPDB_CNPDB10_LENGTH                    0x00000001

#define _CNPDB_CNPDB11_POSITION                  0x0000000B
#define _CNPDB_CNPDB11_MASK                      0x00000800
#define _CNPDB_CNPDB11_LENGTH                    0x00000001

#define _CNPDB_CNPDB12_POSITION                  0x0000000C
#define _CNPDB_CNPDB12_MASK                      0x00001000
#define _CNPDB_CNPDB12_LENGTH                    0x00000001

#define _CNPDB_CNPDB13_POSITION                  0x0000000D
#define _CNPDB_CNPDB13_MASK                      0x00002000
#define _CNPDB_CNPDB13_LENGTH                    0x00000001

#define _CNPDB_CNPDB14_POSITION                  0x0000000E
#define _CNPDB_CNPDB14_MASK                      0x00004000
#define _CNPDB_CNPDB14_LENGTH                    0x00000001

#define _CNPDB_CNPDB15_POSITION                  0x0000000F
#define _CNPDB_CNPDB15_MASK                      0x00008000
#define _CNPDB_CNPDB15_LENGTH                    0x00000001

#define _CNPDB_w_POSITION                        0x00000000
#define _CNPDB_w_MASK                            0xFFFFFFFF
#define _CNPDB_w_LENGTH                          0x00000020

#define _CNCONB_CNSTYLE_POSITION                 0x0000000B
#define _CNCONB_CNSTYLE_MASK                     0x00000800
#define _CNCONB_CNSTYLE_LENGTH                   0x00000001

#define _CNCONB_ON_POSITION                      0x0000000F
#define _CNCONB_ON_MASK                          0x00008000
#define _CNCONB_ON_LENGTH                        0x00000001

#define _CNCONB_w_POSITION                       0x00000000
#define _CNCONB_w_MASK                           0xFFFFFFFF
#define _CNCONB_w_LENGTH                         0x00000020

#define _CNEN0B_CNIE0B0_POSITION                 0x00000000
#define _CNEN0B_CNIE0B0_MASK                     0x00000001
#define _CNEN0B_CNIE0B0_LENGTH                   0x00000001

#define _CNEN0B_CNIE0B1_POSITION                 0x00000001
#define _CNEN0B_CNIE0B1_MASK                     0x00000002
#define _CNEN0B_CNIE0B1_LENGTH                   0x00000001

#define _CNEN0B_CNIE0B2_POSITION                 0x00000002
#define _CNEN0B_CNIE0B2_MASK                     0x00000004
#define _CNEN0B_CNIE0B2_LENGTH                   0x00000001

#define _CNEN0B_CNIE0B3_POSITION                 0x00000003
#define _CNEN0B_CNIE0B3_MASK                     0x00000008
#define _CNEN0B_CNIE0B3_LENGTH                   0x00000001

#define _CNEN0B_CNIE0B4_POSITION                 0x00000004
#define _CNEN0B_CNIE0B4_MASK                     0x00000010
#define _CNEN0B_CNIE0B4_LENGTH                   0x00000001

#define _CNEN0B_CNIE0B5_POSITION                 0x00000005
#define _CNEN0B_CNIE0B5_MASK                     0x00000020
#define _CNEN0B_CNIE0B5_LENGTH                   0x00000001

#define _CNEN0B_CNIE0B6_POSITION                 0x00000006
#define _CNEN0B_CNIE0B6_MASK                     0x00000040
#define _CNEN0B_CNIE0B6_LENGTH                   0x00000001

#define _CNEN0B_CNIE0B7_POSITION                 0x00000007
#define _CNEN0B_CNIE0B7_MASK                     0x00000080
#define _CNEN0B_CNIE0B7_LENGTH                   0x00000001

#define _CNEN0B_CNIE0B8_POSITION                 0x00000008
#define _CNEN0B_CNIE0B8_MASK                     0x00000100
#define _CNEN0B_CNIE0B8_LENGTH                   0x00000001

#define _CNEN0B_CNIE0B9_POSITION                 0x00000009
#define _CNEN0B_CNIE0B9_MASK                     0x00000200
#define _CNEN0B_CNIE0B9_LENGTH                   0x00000001

#define _CNEN0B_CNIE0B10_POSITION                0x0000000A
#define _CNEN0B_CNIE0B10_MASK                    0x00000400
#define _CNEN0B_CNIE0B10_LENGTH                  0x00000001

#define _CNEN0B_CNIE0B11_POSITION                0x0000000B
#define _CNEN0B_CNIE0B11_MASK                    0x00000800
#define _CNEN0B_CNIE0B11_LENGTH                  0x00000001

#define _CNEN0B_CNIE0B12_POSITION                0x0000000C
#define _CNEN0B_CNIE0B12_MASK                    0x00001000
#define _CNEN0B_CNIE0B12_LENGTH                  0x00000001

#define _CNEN0B_CNIE0B13_POSITION                0x0000000D
#define _CNEN0B_CNIE0B13_MASK                    0x00002000
#define _CNEN0B_CNIE0B13_LENGTH                  0x00000001

#define _CNEN0B_CNIE0B14_POSITION                0x0000000E
#define _CNEN0B_CNIE0B14_MASK                    0x00004000
#define _CNEN0B_CNIE0B14_LENGTH                  0x00000001

#define _CNEN0B_CNIE0B15_POSITION                0x0000000F
#define _CNEN0B_CNIE0B15_MASK                    0x00008000
#define _CNEN0B_CNIE0B15_LENGTH                  0x00000001

#define _CNEN0B_w_POSITION                       0x00000000
#define _CNEN0B_w_MASK                           0xFFFFFFFF
#define _CNEN0B_w_LENGTH                         0x00000020

#define _CNSTATB_CNSTATB0_POSITION               0x00000000
#define _CNSTATB_CNSTATB0_MASK                   0x00000001
#define _CNSTATB_CNSTATB0_LENGTH                 0x00000001

#define _CNSTATB_CNSTATB1_POSITION               0x00000001
#define _CNSTATB_CNSTATB1_MASK                   0x00000002
#define _CNSTATB_CNSTATB1_LENGTH                 0x00000001

#define _CNSTATB_CNSTATB2_POSITION               0x00000002
#define _CNSTATB_CNSTATB2_MASK                   0x00000004
#define _CNSTATB_CNSTATB2_LENGTH                 0x00000001

#define _CNSTATB_CNSTATB3_POSITION               0x00000003
#define _CNSTATB_CNSTATB3_MASK                   0x00000008
#define _CNSTATB_CNSTATB3_LENGTH                 0x00000001

#define _CNSTATB_CNSTATB4_POSITION               0x00000004
#define _CNSTATB_CNSTATB4_MASK                   0x00000010
#define _CNSTATB_CNSTATB4_LENGTH                 0x00000001

#define _CNSTATB_CNSTATB5_POSITION               0x00000005
#define _CNSTATB_CNSTATB5_MASK                   0x00000020
#define _CNSTATB_CNSTATB5_LENGTH                 0x00000001

#define _CNSTATB_CNSTATB6_POSITION               0x00000006
#define _CNSTATB_CNSTATB6_MASK                   0x00000040
#define _CNSTATB_CNSTATB6_LENGTH                 0x00000001

