codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mm0032gpl028.h
#define _CNFB_CNFB9_POSITION                     0x00000009
#define _CNFB_CNFB9_MASK                         0x00000200
#define _CNFB_CNFB9_LENGTH                       0x00000001

#define _CNFB_CNFB10_POSITION                    0x0000000A
#define _CNFB_CNFB10_MASK                        0x00000400
#define _CNFB_CNFB10_LENGTH                      0x00000001

#define _CNFB_CNFB11_POSITION                    0x0000000B
#define _CNFB_CNFB11_MASK                        0x00000800
#define _CNFB_CNFB11_LENGTH                      0x00000001

#define _CNFB_CNFB12_POSITION                    0x0000000C
#define _CNFB_CNFB12_MASK                        0x00001000
#define _CNFB_CNFB12_LENGTH                      0x00000001

#define _CNFB_CNFB13_POSITION                    0x0000000D
#define _CNFB_CNFB13_MASK                        0x00002000
#define _CNFB_CNFB13_LENGTH                      0x00000001

#define _CNFB_CNFB14_POSITION                    0x0000000E
#define _CNFB_CNFB14_MASK                        0x00004000
#define _CNFB_CNFB14_LENGTH                      0x00000001

#define _CNFB_CNFB15_POSITION                    0x0000000F
#define _CNFB_CNFB15_MASK                        0x00008000
#define _CNFB_CNFB15_LENGTH                      0x00000001

#define _CNFB_w_POSITION                         0x00000000
#define _CNFB_w_MASK                             0xFFFFFFFF
#define _CNFB_w_LENGTH                           0x00000020

#define _SR0B_SR0B0_POSITION                     0x00000000
#define _SR0B_SR0B0_MASK                         0x00000001
#define _SR0B_SR0B0_LENGTH                       0x00000001

#define _SR0B_SR0B1_POSITION                     0x00000001
#define _SR0B_SR0B1_MASK                         0x00000002
#define _SR0B_SR0B1_LENGTH                       0x00000001

#define _SR0B_SR0B2_POSITION                     0x00000002
#define _SR0B_SR0B2_MASK                         0x00000004
#define _SR0B_SR0B2_LENGTH                       0x00000001

#define _SR0B_SR0B3_POSITION                     0x00000003
#define _SR0B_SR0B3_MASK                         0x00000008
#define _SR0B_SR0B3_LENGTH                       0x00000001

#define _SR0B_SR0B4_POSITION                     0x00000004
#define _SR0B_SR0B4_MASK                         0x00000010
#define _SR0B_SR0B4_LENGTH                       0x00000001

#define _SR0B_SR0B5_POSITION                     0x00000005
#define _SR0B_SR0B5_MASK                         0x00000020
#define _SR0B_SR0B5_LENGTH                       0x00000001

#define _SR0B_SR0B6_POSITION                     0x00000006
#define _SR0B_SR0B6_MASK                         0x00000040
#define _SR0B_SR0B6_LENGTH                       0x00000001

#define _SR0B_SR0B7_POSITION                     0x00000007
#define _SR0B_SR0B7_MASK                         0x00000080
#define _SR0B_SR0B7_LENGTH                       0x00000001

#define _SR0B_SR0B8_POSITION                     0x00000008
#define _SR0B_SR0B8_MASK                         0x00000100
#define _SR0B_SR0B8_LENGTH                       0x00000001

#define _SR0B_SR0B9_POSITION                     0x00000009
#define _SR0B_SR0B9_MASK                         0x00000200
#define _SR0B_SR0B9_LENGTH                       0x00000001

#define _SR0B_SR0B10_POSITION                    0x0000000A
#define _SR0B_SR0B10_MASK                        0x00000400
#define _SR0B_SR0B10_LENGTH                      0x00000001

#define _SR0B_SR0B11_POSITION                    0x0000000B
#define _SR0B_SR0B11_MASK                        0x00000800
#define _SR0B_SR0B11_LENGTH                      0x00000001

#define _SR0B_SR0B12_POSITION                    0x0000000C
#define _SR0B_SR0B12_MASK                        0x00001000
#define _SR0B_SR0B12_LENGTH                      0x00000001

#define _SR0B_SR0B13_POSITION                    0x0000000D
#define _SR0B_SR0B13_MASK                        0x00002000
#define _SR0B_SR0B13_LENGTH                      0x00000001

#define _SR0B_SR0B14_POSITION                    0x0000000E
#define _SR0B_SR0B14_MASK                        0x00004000
#define _SR0B_SR0B14_LENGTH                      0x00000001

#define _SR0B_SR0B15_POSITION                    0x0000000F
#define _SR0B_SR0B15_MASK                        0x00008000
#define _SR0B_SR0B15_LENGTH                      0x00000001

#define _SR0B_w_POSITION                         0x00000000
#define _SR0B_w_MASK                             0xFFFFFFFF
#define _SR0B_w_LENGTH                           0x00000020

#define _SR1B_SR1B0_POSITION                     0x00000000
#define _SR1B_SR1B0_MASK                         0x00000001
#define _SR1B_SR1B0_LENGTH                       0x00000001

#define _SR1B_SR1B1_POSITION                     0x00000001
#define _SR1B_SR1B1_MASK                         0x00000002
#define _SR1B_SR1B1_LENGTH                       0x00000001

#define _SR1B_SR1B2_POSITION                     0x00000002
#define _SR1B_SR1B2_MASK                         0x00000004
#define _SR1B_SR1B2_LENGTH                       0x00000001

#define _SR1B_SR1B3_POSITION                     0x00000003
#define _SR1B_SR1B3_MASK                         0x00000008
#define _SR1B_SR1B3_LENGTH                       0x00000001

#define _SR1B_SR1B4_POSITION                     0x00000004
#define _SR1B_SR1B4_MASK                         0x00000010
#define _SR1B_SR1B4_LENGTH                       0x00000001

#define _SR1B_SR1B5_POSITION                     0x00000005
#define _SR1B_SR1B5_MASK                         0x00000020
#define _SR1B_SR1B5_LENGTH                       0x00000001

#define _SR1B_SR1B6_POSITION                     0x00000006
#define _SR1B_SR1B6_MASK                         0x00000040
#define _SR1B_SR1B6_LENGTH                       0x00000001

#define _SR1B_SR1B7_POSITION                     0x00000007
#define _SR1B_SR1B7_MASK                         0x00000080
#define _SR1B_SR1B7_LENGTH                       0x00000001

#define _SR1B_SR1B8_POSITION                     0x00000008
#define _SR1B_SR1B8_MASK                         0x00000100
#define _SR1B_SR1B8_LENGTH                       0x00000001

#define _SR1B_SR1B9_POSITION                     0x00000009
#define _SR1B_SR1B9_MASK                         0x00000200
#define _SR1B_SR1B9_LENGTH                       0x00000001

#define _SR1B_SR1B10_POSITION                    0x0000000A
#define _SR1B_SR1B10_MASK                        0x00000400
#define _SR1B_SR1B10_LENGTH                      0x00000001

