codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mm0032gpl028.h
#define _SR1B_SR1B11_POSITION                    0x0000000B
#define _SR1B_SR1B11_MASK                        0x00000800
#define _SR1B_SR1B11_LENGTH                      0x00000001

#define _SR1B_SR1B12_POSITION                    0x0000000C
#define _SR1B_SR1B12_MASK                        0x00001000
#define _SR1B_SR1B12_LENGTH                      0x00000001

#define _SR1B_SR1B13_POSITION                    0x0000000D
#define _SR1B_SR1B13_MASK                        0x00002000
#define _SR1B_SR1B13_LENGTH                      0x00000001

#define _SR1B_SR1B14_POSITION                    0x0000000E
#define _SR1B_SR1B14_MASK                        0x00004000
#define _SR1B_SR1B14_LENGTH                      0x00000001

#define _SR1B_SR1B15_POSITION                    0x0000000F
#define _SR1B_SR1B15_MASK                        0x00008000
#define _SR1B_SR1B15_LENGTH                      0x00000001

#define _SR1B_w_POSITION                         0x00000000
#define _SR1B_w_MASK                             0xFFFFFFFF
#define _SR1B_w_LENGTH                           0x00000020

#define _ANSELC_w_POSITION                       0x00000000
#define _ANSELC_w_MASK                           0xFFFFFFFF
#define _ANSELC_w_LENGTH                         0x00000020

#define _TRISC_TRISC9_POSITION                   0x00000009
#define _TRISC_TRISC9_MASK                       0x00000200
#define _TRISC_TRISC9_LENGTH                     0x00000001

#define _TRISC_w_POSITION                        0x00000000
#define _TRISC_w_MASK                            0xFFFFFFFF
#define _TRISC_w_LENGTH                          0x00000020

#define _PORTC_RC9_POSITION                      0x00000009
#define _PORTC_RC9_MASK                          0x00000200
#define _PORTC_RC9_LENGTH                        0x00000001

#define _PORTC_w_POSITION                        0x00000000
#define _PORTC_w_MASK                            0xFFFFFFFF
#define _PORTC_w_LENGTH                          0x00000020

#define _LATC_LATC9_POSITION                     0x00000009
#define _LATC_LATC9_MASK                         0x00000200
#define _LATC_LATC9_LENGTH                       0x00000001

#define _LATC_w_POSITION                         0x00000000
#define _LATC_w_MASK                             0xFFFFFFFF
#define _LATC_w_LENGTH                           0x00000020

#define _ODCC_ODCC9_POSITION                     0x00000009
#define _ODCC_ODCC9_MASK                         0x00000200
#define _ODCC_ODCC9_LENGTH                       0x00000001

#define _ODCC_w_POSITION                         0x00000000
#define _ODCC_w_MASK                             0xFFFFFFFF
#define _ODCC_w_LENGTH                           0x00000020

#define _CNPUC_CNPUC9_POSITION                   0x00000009
#define _CNPUC_CNPUC9_MASK                       0x00000200
#define _CNPUC_CNPUC9_LENGTH                     0x00000001

#define _CNPUC_w_POSITION                        0x00000000
#define _CNPUC_w_MASK                            0xFFFFFFFF
#define _CNPUC_w_LENGTH                          0x00000020

#define _CNPDC_CNPDC9_POSITION                   0x00000009
#define _CNPDC_CNPDC9_MASK                       0x00000200
#define _CNPDC_CNPDC9_LENGTH                     0x00000001

#define _CNPDC_w_POSITION                        0x00000000
#define _CNPDC_w_MASK                            0xFFFFFFFF
#define _CNPDC_w_LENGTH                          0x00000020

#define _CNCONC_CNSTYLE_POSITION                 0x0000000B
#define _CNCONC_CNSTYLE_MASK                     0x00000800
#define _CNCONC_CNSTYLE_LENGTH                   0x00000001

#define _CNCONC_ON_POSITION                      0x0000000F
#define _CNCONC_ON_MASK                          0x00008000
#define _CNCONC_ON_LENGTH                        0x00000001

#define _CNCONC_w_POSITION                       0x00000000
#define _CNCONC_w_MASK                           0xFFFFFFFF
#define _CNCONC_w_LENGTH                         0x00000020

#define _CNEN0C_CNIE0C9_POSITION                 0x00000009
#define _CNEN0C_CNIE0C9_MASK                     0x00000200
#define _CNEN0C_CNIE0C9_LENGTH                   0x00000001

#define _CNEN0C_w_POSITION                       0x00000000
#define _CNEN0C_w_MASK                           0xFFFFFFFF
#define _CNEN0C_w_LENGTH                         0x00000020

#define _CNSTATC_CNSTATC9_POSITION               0x00000009
#define _CNSTATC_CNSTATC9_MASK                   0x00000200
#define _CNSTATC_CNSTATC9_LENGTH                 0x00000001

#define _CNSTATC_w_POSITION                      0x00000000
#define _CNSTATC_w_MASK                          0xFFFFFFFF
#define _CNSTATC_w_LENGTH                        0x00000020

#define _CNEN1C_CNIE1C9_POSITION                 0x00000009
#define _CNEN1C_CNIE1C9_MASK                     0x00000200
#define _CNEN1C_CNIE1C9_LENGTH                   0x00000001

#define _CNEN1C_w_POSITION                       0x00000000
#define _CNEN1C_w_MASK                           0xFFFFFFFF
#define _CNEN1C_w_LENGTH                         0x00000020

#define _CNFC_CNFC9_POSITION                     0x00000009
#define _CNFC_CNFC9_MASK                         0x00000200
#define _CNFC_CNFC9_LENGTH                       0x00000001

#define _CNFC_w_POSITION                         0x00000000
#define _CNFC_w_MASK                             0xFFFFFFFF
#define _CNFC_w_LENGTH                           0x00000020

#define _SR0C_SR0C9_POSITION                     0x00000009
#define _SR0C_SR0C9_MASK                         0x00000200
#define _SR0C_SR0C9_LENGTH                       0x00000001

#define _SR0C_w_POSITION                         0x00000000
#define _SR0C_w_MASK                             0xFFFFFFFF
#define _SR0C_w_LENGTH                           0x00000020

#define _SR1C_SR1C9_POSITION                     0x00000009
#define _SR1C_SR1C9_MASK                         0x00000200
#define _SR1C_SR1C9_LENGTH                       0x00000001

#define _SR1C_w_POSITION                         0x00000000
#define _SR1C_w_MASK                             0xFFFFFFFF
#define _SR1C_w_LENGTH                           0x00000020

#define _PMDCON_PMDLOCK_POSITION                 0x0000000B
#define _PMDCON_PMDLOCK_MASK                     0x00000800
#define _PMDCON_PMDLOCK_LENGTH                   0x00000001

