codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mm0032gpl028.h
#define _IPC3_CMP2IS_POSITION                    0x00000008
#define _IPC3_CMP2IS_MASK                        0x00000300
#define _IPC3_CMP2IS_LENGTH                      0x00000002

#define _IPC3_CMP2IP_POSITION                    0x0000000A
#define _IPC3_CMP2IP_MASK                        0x00001C00
#define _IPC3_CMP2IP_LENGTH                      0x00000003

#define _IPC3_RTCCIS_POSITION                    0x00000010
#define _IPC3_RTCCIS_MASK                        0x00030000
#define _IPC3_RTCCIS_LENGTH                      0x00000002

#define _IPC3_RTCCIP_POSITION                    0x00000012
#define _IPC3_RTCCIP_MASK                        0x001C0000
#define _IPC3_RTCCIP_LENGTH                      0x00000003

#define _IPC3_AD1IS_POSITION                     0x00000018
#define _IPC3_AD1IS_MASK                         0x03000000
#define _IPC3_AD1IS_LENGTH                       0x00000002

#define _IPC3_AD1IP_POSITION                     0x0000001A
#define _IPC3_AD1IP_MASK                         0x1C000000
#define _IPC3_AD1IP_LENGTH                       0x00000003

#define _IPC3_w_POSITION                         0x00000000
#define _IPC3_w_MASK                             0xFFFFFFFF
#define _IPC3_w_LENGTH                           0x00000020

#define _IPC4_CRCIS_POSITION                     0x00000000
#define _IPC4_CRCIS_MASK                         0x00000003
#define _IPC4_CRCIS_LENGTH                       0x00000002

#define _IPC4_CRCIP_POSITION                     0x00000002
#define _IPC4_CRCIP_MASK                         0x0000001C
#define _IPC4_CRCIP_LENGTH                       0x00000003

#define _IPC4_LVDIS_POSITION                     0x00000008
#define _IPC4_LVDIS_MASK                         0x00000300
#define _IPC4_LVDIS_LENGTH                       0x00000002

#define _IPC4_LVDIP_POSITION                     0x0000000A
#define _IPC4_LVDIP_MASK                         0x00001C00
#define _IPC4_LVDIP_LENGTH                       0x00000003

#define _IPC4_CLC1IS_POSITION                    0x00000010
#define _IPC4_CLC1IS_MASK                        0x00030000
#define _IPC4_CLC1IS_LENGTH                      0x00000002

#define _IPC4_CLC1IP_POSITION                    0x00000012
#define _IPC4_CLC1IP_MASK                        0x001C0000
#define _IPC4_CLC1IP_LENGTH                      0x00000003

#define _IPC4_CLC2IS_POSITION                    0x00000018
#define _IPC4_CLC2IS_MASK                        0x03000000
#define _IPC4_CLC2IS_LENGTH                      0x00000002

#define _IPC4_CLC2IP_POSITION                    0x0000001A
#define _IPC4_CLC2IP_MASK                        0x1C000000
#define _IPC4_CLC2IP_LENGTH                      0x00000003

#define _IPC4_w_POSITION                         0x00000000
#define _IPC4_w_MASK                             0xFFFFFFFF
#define _IPC4_w_LENGTH                           0x00000020

#define _IPC5_SPI1EIS_POSITION                   0x00000000
#define _IPC5_SPI1EIS_MASK                       0x00000003
#define _IPC5_SPI1EIS_LENGTH                     0x00000002

#define _IPC5_SPI1EIP_POSITION                   0x00000002
#define _IPC5_SPI1EIP_MASK                       0x0000001C
#define _IPC5_SPI1EIP_LENGTH                     0x00000003

#define _IPC5_SPI1TXIS_POSITION                  0x00000008
#define _IPC5_SPI1TXIS_MASK                      0x00000300
#define _IPC5_SPI1TXIS_LENGTH                    0x00000002

#define _IPC5_SPI1TXIP_POSITION                  0x0000000A
#define _IPC5_SPI1TXIP_MASK                      0x00001C00
#define _IPC5_SPI1TXIP_LENGTH                    0x00000003

#define _IPC5_SPI1RXIS_POSITION                  0x00000010
#define _IPC5_SPI1RXIS_MASK                      0x00030000
#define _IPC5_SPI1RXIS_LENGTH                    0x00000002

#define _IPC5_SPI1RXIP_POSITION                  0x00000012
#define _IPC5_SPI1RXIP_MASK                      0x001C0000
#define _IPC5_SPI1RXIP_LENGTH                    0x00000003

#define _IPC5_U1RXIS_POSITION                    0x00000018
#define _IPC5_U1RXIS_MASK                        0x03000000
#define _IPC5_U1RXIS_LENGTH                      0x00000002

#define _IPC5_U1RXIP_POSITION                    0x0000001A
#define _IPC5_U1RXIP_MASK                        0x1C000000
#define _IPC5_U1RXIP_LENGTH                      0x00000003

#define _IPC5_w_POSITION                         0x00000000
#define _IPC5_w_MASK                             0xFFFFFFFF
#define _IPC5_w_LENGTH                           0x00000020

#define _IPC6_U1TXIS_POSITION                    0x00000000
#define _IPC6_U1TXIS_MASK                        0x00000003
#define _IPC6_U1TXIS_LENGTH                      0x00000002

#define _IPC6_U1TXIP_POSITION                    0x00000002
#define _IPC6_U1TXIP_MASK                        0x0000001C
#define _IPC6_U1TXIP_LENGTH                      0x00000003

#define _IPC6_U1EIS_POSITION                     0x00000008
#define _IPC6_U1EIS_MASK                         0x00000300
#define _IPC6_U1EIS_LENGTH                       0x00000002

#define _IPC6_U1EIP_POSITION                     0x0000000A
#define _IPC6_U1EIP_MASK                         0x00001C00
#define _IPC6_U1EIP_LENGTH                       0x00000003

#define _IPC6_I2C1SIS_POSITION                   0x00000010
#define _IPC6_I2C1SIS_MASK                       0x00030000
#define _IPC6_I2C1SIS_LENGTH                     0x00000002

#define _IPC6_I2C1SIP_POSITION                   0x00000012
#define _IPC6_I2C1SIP_MASK                       0x001C0000
#define _IPC6_I2C1SIP_LENGTH                     0x00000003

#define _IPC6_I2C1MIS_POSITION                   0x00000018
#define _IPC6_I2C1MIS_MASK                       0x03000000
#define _IPC6_I2C1MIS_LENGTH                     0x00000002

#define _IPC6_I2C1MIP_POSITION                   0x0000001A
#define _IPC6_I2C1MIP_MASK                       0x1C000000
#define _IPC6_I2C1MIP_LENGTH                     0x00000003

#define _IPC6_w_POSITION                         0x00000000
#define _IPC6_w_MASK                             0xFFFFFFFF
#define _IPC6_w_LENGTH                           0x00000020

#define _IPC7_I2C1BCIS_POSITION                  0x00000000
#define _IPC7_I2C1BCIS_MASK                      0x00000003
#define _IPC7_I2C1BCIS_LENGTH                    0x00000002

#define _IPC7_I2C1BCIP_POSITION                  0x00000002
#define _IPC7_I2C1BCIP_MASK                      0x0000001C
#define _IPC7_I2C1BCIP_LENGTH                    0x00000003

#define _IPC7_CCP1IS_POSITION                    0x00000008
#define _IPC7_CCP1IS_MASK                        0x00000300
#define _IPC7_CCP1IS_LENGTH                      0x00000002

#define _IPC7_CCP1IP_POSITION                    0x0000000A
#define _IPC7_CCP1IP_MASK                        0x00001C00
#define _IPC7_CCP1IP_LENGTH                      0x00000003

#define _IPC7_CCT1IS_POSITION                    0x00000010
#define _IPC7_CCT1IS_MASK                        0x00030000
#define _IPC7_CCT1IS_LENGTH                      0x00000002

#define _IPC7_CCT1IP_POSITION                    0x00000012
#define _IPC7_CCT1IP_MASK                        0x001C0000
#define _IPC7_CCT1IP_LENGTH                      0x00000003

#define _IPC7_CCP2IS_POSITION                    0x00000018
#define _IPC7_CCP2IS_MASK                        0x03000000
#define _IPC7_CCP2IS_LENGTH                      0x00000002

#define _IPC7_CCP2IP_POSITION                    0x0000001A
#define _IPC7_CCP2IP_MASK                        0x1C000000
#define _IPC7_CCP2IP_LENGTH                      0x00000003

#define _IPC7_w_POSITION                         0x00000000
#define _IPC7_w_MASK                             0xFFFFFFFF
#define _IPC7_w_LENGTH                           0x00000020

#define _IPC8_CCT2IS_POSITION                    0x00000000
#define _IPC8_CCT2IS_MASK                        0x00000003
#define _IPC8_CCT2IS_LENGTH                      0x00000002

#define _IPC8_CCT2IP_POSITION                    0x00000002
#define _IPC8_CCT2IP_MASK                        0x0000001C
#define _IPC8_CCT2IP_LENGTH                      0x00000003

#define _IPC8_CCP3IS_POSITION                    0x00000008
#define _IPC8_CCP3IS_MASK                        0x00000300
#define _IPC8_CCP3IS_LENGTH                      0x00000002

#define _IPC8_CCP3IP_POSITION                    0x0000000A
#define _IPC8_CCP3IP_MASK                        0x00001C00
#define _IPC8_CCP3IP_LENGTH                      0x00000003

